MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
extern volatile __EMACxCFG2bits_t EMACxCFG2bits __asm__ ("EMACxCFG2") __attribute__((section("sfrs"), address(0xBF889210)));
extern volatile uint32_t        EMAC1CFG2CLR __attribute__((section("sfrs"),address(0xBF889214)));
extern volatile uint32_t        EMACxCFG2CLR __attribute__((section("sfrs"),address(0xBF889214)));
extern volatile uint32_t        EMAC1CFG2SET __attribute__((section("sfrs"),address(0xBF889218)));
extern volatile uint32_t        EMACxCFG2SET __attribute__((section("sfrs"),address(0xBF889218)));
extern volatile uint32_t        EMAC1CFG2INV __attribute__((section("sfrs"),address(0xBF88921C)));
extern volatile uint32_t        EMACxCFG2INV __attribute__((section("sfrs"),address(0xBF88921C)));
#define EMAC1IPGT EMAC1IPGT
extern volatile uint32_t   EMAC1IPGT __attribute__((section("sfrs"), address(0xBF889220)));
typedef union {
  struct {
    uint32_t B2BIPKTGP:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1IPGTbits_t;
extern volatile __EMAC1IPGTbits_t EMAC1IPGTbits __asm__ ("EMAC1IPGT") __attribute__((section("sfrs"), address(0xBF889220)));
#define EMACxIPGT EMACxIPGT
extern volatile uint32_t   EMACxIPGT __attribute__((section("sfrs"), address(0xBF889220)));
typedef union {
  struct {
    uint32_t B2BIPKTGP:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxIPGTbits_t;
extern volatile __EMACxIPGTbits_t EMACxIPGTbits __asm__ ("EMACxIPGT") __attribute__((section("sfrs"), address(0xBF889220)));
extern volatile uint32_t        EMAC1IPGTCLR __attribute__((section("sfrs"),address(0xBF889224)));
extern volatile uint32_t        EMACxIPGTCLR __attribute__((section("sfrs"),address(0xBF889224)));
extern volatile uint32_t        EMAC1IPGTSET __attribute__((section("sfrs"),address(0xBF889228)));
extern volatile uint32_t        EMACxIPGTSET __attribute__((section("sfrs"),address(0xBF889228)));
extern volatile uint32_t        EMAC1IPGTINV __attribute__((section("sfrs"),address(0xBF88922C)));
extern volatile uint32_t        EMACxIPGTINV __attribute__((section("sfrs"),address(0xBF88922C)));
#define EMAC1IPGR EMAC1IPGR
extern volatile uint32_t   EMAC1IPGR __attribute__((section("sfrs"), address(0xBF889230)));
typedef union {
  struct {
    uint32_t NB2BIPKTGP2:7;
    uint32_t :1;
    uint32_t NB2BIPKTGP1:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1IPGRbits_t;
extern volatile __EMAC1IPGRbits_t EMAC1IPGRbits __asm__ ("EMAC1IPGR") __attribute__((section("sfrs"), address(0xBF889230)));
#define EMACxIPGR EMACxIPGR
extern volatile uint32_t   EMACxIPGR __attribute__((section("sfrs"), address(0xBF889230)));
typedef union {
  struct {
    uint32_t NB2BIPKTGP2:7;
    uint32_t :1;
    uint32_t NB2BIPKTGP1:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxIPGRbits_t;
extern volatile __EMACxIPGRbits_t EMACxIPGRbits __asm__ ("EMACxIPGR") __attribute__((section("sfrs"), address(0xBF889230)));
extern volatile uint32_t        EMAC1IPGRCLR __attribute__((section("sfrs"),address(0xBF889234)));
extern volatile uint32_t        EMACxIPGRCLR __attribute__((section("sfrs"),address(0xBF889234)));
extern volatile uint32_t        EMAC1IPGRSET __attribute__((section("sfrs"),address(0xBF889238)));
extern volatile uint32_t        EMACxIPGRSET __attribute__((section("sfrs"),address(0xBF889238)));
extern volatile uint32_t        EMAC1IPGRINV __attribute__((section("sfrs"),address(0xBF88923C)));
extern volatile uint32_t        EMACxIPGRINV __attribute__((section("sfrs"),address(0xBF88923C)));
#define EMAC1CLRT EMAC1CLRT
extern volatile uint32_t   EMAC1CLRT __attribute__((section("sfrs"), address(0xBF889240)));
typedef union {
  struct {
    uint32_t RETX:4;
    uint32_t :4;
    uint32_t CWINDOW:6;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1CLRTbits_t;
extern volatile __EMAC1CLRTbits_t EMAC1CLRTbits __asm__ ("EMAC1CLRT") __attribute__((section("sfrs"), address(0xBF889240)));
#define EMACxCLRT EMACxCLRT
extern volatile uint32_t   EMACxCLRT __attribute__((section("sfrs"), address(0xBF889240)));
typedef union {
  struct {
    uint32_t RETX:4;
    uint32_t :4;
    uint32_t CWINDOW:6;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxCLRTbits_t;
extern volatile __EMACxCLRTbits_t EMACxCLRTbits __asm__ ("EMACxCLRT") __attribute__((section("sfrs"), address(0xBF889240)));
extern volatile uint32_t        EMAC1CLRTCLR __attribute__((section("sfrs"),address(0xBF889244)));
extern volatile uint32_t        EMACxCLRTCLR __attribute__((section("sfrs"),address(0xBF889244)));
extern volatile uint32_t        EMAC1CLRTSET __attribute__((section("sfrs"),address(0xBF889248)));
extern volatile uint32_t        EMACxCLRTSET __attribute__((section("sfrs"),address(0xBF889248)));
extern volatile uint32_t        EMAC1CLRTINV __attribute__((section("sfrs"),address(0xBF88924C)));
extern volatile uint32_t        EMACxCLRTINV __attribute__((section("sfrs"),address(0xBF88924C)));
#define EMAC1MAXF EMAC1MAXF
extern volatile uint32_t   EMAC1MAXF __attribute__((section("sfrs"), address(0xBF889250)));
typedef union {
  struct {
    uint32_t MACMAXF:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MAXFbits_t;
extern volatile __EMAC1MAXFbits_t EMAC1MAXFbits __asm__ ("EMAC1MAXF") __attribute__((section("sfrs"), address(0xBF889250)));
#define EMACxMAXF EMACxMAXF
extern volatile uint32_t   EMACxMAXF __attribute__((section("sfrs"), address(0xBF889250)));
typedef union {
  struct {
    uint32_t MACMAXF:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMAXFbits_t;
extern volatile __EMACxMAXFbits_t EMACxMAXFbits __asm__ ("EMACxMAXF") __attribute__((section("sfrs"), address(0xBF889250)));
extern volatile uint32_t        EMAC1MAXFCLR __attribute__((section("sfrs"),address(0xBF889254)));
extern volatile uint32_t        EMACxMAXFCLR __attribute__((section("sfrs"),address(0xBF889254)));
extern volatile uint32_t        EMAC1MAXFSET __attribute__((section("sfrs"),address(0xBF889258)));
extern volatile uint32_t        EMACxMAXFSET __attribute__((section("sfrs"),address(0xBF889258)));
extern volatile uint32_t        EMAC1MAXFINV __attribute__((section("sfrs"),address(0xBF88925C)));
extern volatile uint32_t        EMACxMAXFINV __attribute__((section("sfrs"),address(0xBF88925C)));
#define EMAC1SUPP EMAC1SUPP
extern volatile uint32_t   EMAC1SUPP __attribute__((section("sfrs"), address(0xBF889260)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPEEDRMII:1;
    uint32_t :2;
    uint32_t RESETRMII:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SUPPbits_t;
extern volatile __EMAC1SUPPbits_t EMAC1SUPPbits __asm__ ("EMAC1SUPP") __attribute__((section("sfrs"), address(0xBF889260)));
#define EMACxSUPP EMACxSUPP
extern volatile uint32_t   EMACxSUPP __attribute__((section("sfrs"), address(0xBF889260)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPEEDRMII:1;
    uint32_t :2;
    uint32_t RESETRMII:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSUPPbits_t;
