MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
extern volatile __C1FIFOCON31bits_t C1FIFOCON31bits __asm__ ("C1FIFOCON31") __attribute__((section("sfrs"), address(0xBF88BB10)));
extern volatile uint32_t        C1FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF88BB14)));
extern volatile uint32_t        C1FIFOCON31SET __attribute__((section("sfrs"),address(0xBF88BB18)));
extern volatile uint32_t        C1FIFOCON31INV __attribute__((section("sfrs"),address(0xBF88BB1C)));
#define C1FIFOINT31 C1FIFOINT31
extern volatile uint32_t   C1FIFOINT31 __attribute__((section("sfrs"), address(0xBF88BB20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT31bits_t;
extern volatile __C1FIFOINT31bits_t C1FIFOINT31bits __asm__ ("C1FIFOINT31") __attribute__((section("sfrs"), address(0xBF88BB20)));
extern volatile uint32_t        C1FIFOINT31CLR __attribute__((section("sfrs"),address(0xBF88BB24)));
extern volatile uint32_t        C1FIFOINT31SET __attribute__((section("sfrs"),address(0xBF88BB28)));
extern volatile uint32_t        C1FIFOINT31INV __attribute__((section("sfrs"),address(0xBF88BB2C)));
#define C1FIFOUA31 C1FIFOUA31
extern volatile uint32_t   C1FIFOUA31 __attribute__((section("sfrs"), address(0xBF88BB30)));
extern volatile uint32_t        C1FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF88BB34)));
extern volatile uint32_t        C1FIFOUA31SET __attribute__((section("sfrs"),address(0xBF88BB38)));
extern volatile uint32_t        C1FIFOUA31INV __attribute__((section("sfrs"),address(0xBF88BB3C)));
#define C1FIFOCI31 C1FIFOCI31
extern volatile uint32_t   C1FIFOCI31 __attribute__((section("sfrs"), address(0xBF88BB40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI31bits_t;
extern volatile __C1FIFOCI31bits_t C1FIFOCI31bits __asm__ ("C1FIFOCI31") __attribute__((section("sfrs"), address(0xBF88BB40)));
extern volatile uint32_t        C1FIFOCI31CLR __attribute__((section("sfrs"),address(0xBF88BB44)));
extern volatile uint32_t        C1FIFOCI31SET __attribute__((section("sfrs"),address(0xBF88BB48)));
extern volatile uint32_t        C1FIFOCI31INV __attribute__((section("sfrs"),address(0xBF88BB4C)));
#define C2CON C2CON
extern volatile uint32_t   C2CON __attribute__((section("sfrs"), address(0xBF88C000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2CONbits_t;
extern volatile __C2CONbits_t C2CONbits __asm__ ("C2CON") __attribute__((section("sfrs"), address(0xBF88C000)));
extern volatile uint32_t        C2CONCLR __attribute__((section("sfrs"),address(0xBF88C004)));
extern volatile uint32_t        C2CONSET __attribute__((section("sfrs"),address(0xBF88C008)));
extern volatile uint32_t        C2CONINV __attribute__((section("sfrs"),address(0xBF88C00C)));
#define C2CFG C2CFG
extern volatile uint32_t   C2CFG __attribute__((section("sfrs"), address(0xBF88C010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2CFGbits_t;
extern volatile __C2CFGbits_t C2CFGbits __asm__ ("C2CFG") __attribute__((section("sfrs"), address(0xBF88C010)));
extern volatile uint32_t        C2CFGCLR __attribute__((section("sfrs"),address(0xBF88C014)));
extern volatile uint32_t        C2CFGSET __attribute__((section("sfrs"),address(0xBF88C018)));
extern volatile uint32_t        C2CFGINV __attribute__((section("sfrs"),address(0xBF88C01C)));
#define C2INT C2INT
extern volatile uint32_t   C2INT __attribute__((section("sfrs"), address(0xBF88C020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2INTbits_t;
extern volatile __C2INTbits_t C2INTbits __asm__ ("C2INT") __attribute__((section("sfrs"), address(0xBF88C020)));
extern volatile uint32_t        C2INTCLR __attribute__((section("sfrs"),address(0xBF88C024)));
extern volatile uint32_t        C2INTSET __attribute__((section("sfrs"),address(0xBF88C028)));
extern volatile uint32_t        C2INTINV __attribute__((section("sfrs"),address(0xBF88C02C)));
#define C2VEC C2VEC
extern volatile uint32_t   C2VEC __attribute__((section("sfrs"), address(0xBF88C030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2VECbits_t;
extern volatile __C2VECbits_t C2VECbits __asm__ ("C2VEC") __attribute__((section("sfrs"), address(0xBF88C030)));
extern volatile uint32_t        C2VECCLR __attribute__((section("sfrs"),address(0xBF88C034)));
extern volatile uint32_t        C2VECSET __attribute__((section("sfrs"),address(0xBF88C038)));
extern volatile uint32_t        C2VECINV __attribute__((section("sfrs"),address(0xBF88C03C)));
#define C2TREC C2TREC
extern volatile uint32_t   C2TREC __attribute__((section("sfrs"), address(0xBF88C040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2TRECbits_t;
