MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
extern volatile __C2RXF23bits_t C2RXF23bits __asm__ ("C2RXF23") __attribute__((section("sfrs"), address(0xBF88C2B0)));
extern volatile uint32_t        C2RXF23CLR __attribute__((section("sfrs"),address(0xBF88C2B4)));
extern volatile uint32_t        C2RXF23SET __attribute__((section("sfrs"),address(0xBF88C2B8)));
extern volatile uint32_t        C2RXF23INV __attribute__((section("sfrs"),address(0xBF88C2BC)));
#define C2RXF24 C2RXF24
extern volatile uint32_t   C2RXF24 __attribute__((section("sfrs"), address(0xBF88C2C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF24bits_t;
extern volatile __C2RXF24bits_t C2RXF24bits __asm__ ("C2RXF24") __attribute__((section("sfrs"), address(0xBF88C2C0)));
extern volatile uint32_t        C2RXF24CLR __attribute__((section("sfrs"),address(0xBF88C2C4)));
extern volatile uint32_t        C2RXF24SET __attribute__((section("sfrs"),address(0xBF88C2C8)));
extern volatile uint32_t        C2RXF24INV __attribute__((section("sfrs"),address(0xBF88C2CC)));
#define C2RXF25 C2RXF25
extern volatile uint32_t   C2RXF25 __attribute__((section("sfrs"), address(0xBF88C2D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF25bits_t;
extern volatile __C2RXF25bits_t C2RXF25bits __asm__ ("C2RXF25") __attribute__((section("sfrs"), address(0xBF88C2D0)));
extern volatile uint32_t        C2RXF25CLR __attribute__((section("sfrs"),address(0xBF88C2D4)));
extern volatile uint32_t        C2RXF25SET __attribute__((section("sfrs"),address(0xBF88C2D8)));
extern volatile uint32_t        C2RXF25INV __attribute__((section("sfrs"),address(0xBF88C2DC)));
#define C2RXF26 C2RXF26
extern volatile uint32_t   C2RXF26 __attribute__((section("sfrs"), address(0xBF88C2E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF26bits_t;
extern volatile __C2RXF26bits_t C2RXF26bits __asm__ ("C2RXF26") __attribute__((section("sfrs"), address(0xBF88C2E0)));
extern volatile uint32_t        C2RXF26CLR __attribute__((section("sfrs"),address(0xBF88C2E4)));
extern volatile uint32_t        C2RXF26SET __attribute__((section("sfrs"),address(0xBF88C2E8)));
extern volatile uint32_t        C2RXF26INV __attribute__((section("sfrs"),address(0xBF88C2EC)));
#define C2RXF27 C2RXF27
extern volatile uint32_t   C2RXF27 __attribute__((section("sfrs"), address(0xBF88C2F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF27bits_t;
extern volatile __C2RXF27bits_t C2RXF27bits __asm__ ("C2RXF27") __attribute__((section("sfrs"), address(0xBF88C2F0)));
extern volatile uint32_t        C2RXF27CLR __attribute__((section("sfrs"),address(0xBF88C2F4)));
extern volatile uint32_t        C2RXF27SET __attribute__((section("sfrs"),address(0xBF88C2F8)));
extern volatile uint32_t        C2RXF27INV __attribute__((section("sfrs"),address(0xBF88C2FC)));
#define C2RXF28 C2RXF28
extern volatile uint32_t   C2RXF28 __attribute__((section("sfrs"), address(0xBF88C300)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF28bits_t;
extern volatile __C2RXF28bits_t C2RXF28bits __asm__ ("C2RXF28") __attribute__((section("sfrs"), address(0xBF88C300)));
extern volatile uint32_t        C2RXF28CLR __attribute__((section("sfrs"),address(0xBF88C304)));
extern volatile uint32_t        C2RXF28SET __attribute__((section("sfrs"),address(0xBF88C308)));
extern volatile uint32_t        C2RXF28INV __attribute__((section("sfrs"),address(0xBF88C30C)));
#define C2RXF29 C2RXF29
extern volatile uint32_t   C2RXF29 __attribute__((section("sfrs"), address(0xBF88C310)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF29bits_t;
extern volatile __C2RXF29bits_t C2RXF29bits __asm__ ("C2RXF29") __attribute__((section("sfrs"), address(0xBF88C310)));
extern volatile uint32_t        C2RXF29CLR __attribute__((section("sfrs"),address(0xBF88C314)));
extern volatile uint32_t        C2RXF29SET __attribute__((section("sfrs"),address(0xBF88C318)));
extern volatile uint32_t        C2RXF29INV __attribute__((section("sfrs"),address(0xBF88C31C)));
#define C2RXF30 C2RXF30
extern volatile uint32_t   C2RXF30 __attribute__((section("sfrs"), address(0xBF88C320)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF30bits_t;
extern volatile __C2RXF30bits_t C2RXF30bits __asm__ ("C2RXF30") __attribute__((section("sfrs"), address(0xBF88C320)));
extern volatile uint32_t        C2RXF30CLR __attribute__((section("sfrs"),address(0xBF88C324)));
extern volatile uint32_t        C2RXF30SET __attribute__((section("sfrs"),address(0xBF88C328)));
extern volatile uint32_t        C2RXF30INV __attribute__((section("sfrs"),address(0xBF88C32C)));
#define C2RXF31 C2RXF31
extern volatile uint32_t   C2RXF31 __attribute__((section("sfrs"), address(0xBF88C330)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF31bits_t;
extern volatile __C2RXF31bits_t C2RXF31bits __asm__ ("C2RXF31") __attribute__((section("sfrs"), address(0xBF88C330)));
extern volatile uint32_t        C2RXF31CLR __attribute__((section("sfrs"),address(0xBF88C334)));
extern volatile uint32_t        C2RXF31SET __attribute__((section("sfrs"),address(0xBF88C338)));
extern volatile uint32_t        C2RXF31INV __attribute__((section("sfrs"),address(0xBF88C33C)));
#define C2FIFOBA C2FIFOBA
extern volatile uint32_t   C2FIFOBA __attribute__((section("sfrs"), address(0xBF88C340)));
extern volatile uint32_t        C2FIFOBACLR __attribute__((section("sfrs"),address(0xBF88C344)));
extern volatile uint32_t        C2FIFOBASET __attribute__((section("sfrs"),address(0xBF88C348)));
extern volatile uint32_t        C2FIFOBAINV __attribute__((section("sfrs"),address(0xBF88C34C)));
#define C2FIFOCON0 C2FIFOCON0
extern volatile uint32_t   C2FIFOCON0 __attribute__((section("sfrs"), address(0xBF88C350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON0bits_t;
extern volatile __C2FIFOCON0bits_t C2FIFOCON0bits __asm__ ("C2FIFOCON0") __attribute__((section("sfrs"), address(0xBF88C350)));
extern volatile uint32_t        C2FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF88C354)));
extern volatile uint32_t        C2FIFOCON0SET __attribute__((section("sfrs"),address(0xBF88C358)));
extern volatile uint32_t        C2FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88C35C)));
#define C2FIFOINT0 C2FIFOINT0
extern volatile uint32_t   C2FIFOINT0 __attribute__((section("sfrs"), address(0xBF88C360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT0bits_t;
