MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
extern volatile __C2FIFOINT3bits_t C2FIFOINT3bits __asm__ ("C2FIFOINT3") __attribute__((section("sfrs"), address(0xBF88C420)));
extern volatile uint32_t        C2FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF88C424)));
extern volatile uint32_t        C2FIFOINT3SET __attribute__((section("sfrs"),address(0xBF88C428)));
extern volatile uint32_t        C2FIFOINT3INV __attribute__((section("sfrs"),address(0xBF88C42C)));
#define C2FIFOUA3 C2FIFOUA3
extern volatile uint32_t   C2FIFOUA3 __attribute__((section("sfrs"), address(0xBF88C430)));
extern volatile uint32_t        C2FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF88C434)));
extern volatile uint32_t        C2FIFOUA3SET __attribute__((section("sfrs"),address(0xBF88C438)));
extern volatile uint32_t        C2FIFOUA3INV __attribute__((section("sfrs"),address(0xBF88C43C)));
#define C2FIFOCI3 C2FIFOCI3
extern volatile uint32_t   C2FIFOCI3 __attribute__((section("sfrs"), address(0xBF88C440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI3bits_t;
extern volatile __C2FIFOCI3bits_t C2FIFOCI3bits __asm__ ("C2FIFOCI3") __attribute__((section("sfrs"), address(0xBF88C440)));
extern volatile uint32_t        C2FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF88C444)));
extern volatile uint32_t        C2FIFOCI3SET __attribute__((section("sfrs"),address(0xBF88C448)));
extern volatile uint32_t        C2FIFOCI3INV __attribute__((section("sfrs"),address(0xBF88C44C)));
#define C2FIFOCON4 C2FIFOCON4
extern volatile uint32_t   C2FIFOCON4 __attribute__((section("sfrs"), address(0xBF88C450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON4bits_t;
extern volatile __C2FIFOCON4bits_t C2FIFOCON4bits __asm__ ("C2FIFOCON4") __attribute__((section("sfrs"), address(0xBF88C450)));
extern volatile uint32_t        C2FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF88C454)));
extern volatile uint32_t        C2FIFOCON4SET __attribute__((section("sfrs"),address(0xBF88C458)));
extern volatile uint32_t        C2FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88C45C)));
#define C2FIFOINT4 C2FIFOINT4
extern volatile uint32_t   C2FIFOINT4 __attribute__((section("sfrs"), address(0xBF88C460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT4bits_t;
extern volatile __C2FIFOINT4bits_t C2FIFOINT4bits __asm__ ("C2FIFOINT4") __attribute__((section("sfrs"), address(0xBF88C460)));
extern volatile uint32_t        C2FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF88C464)));
extern volatile uint32_t        C2FIFOINT4SET __attribute__((section("sfrs"),address(0xBF88C468)));
extern volatile uint32_t        C2FIFOINT4INV __attribute__((section("sfrs"),address(0xBF88C46C)));
#define C2FIFOUA4 C2FIFOUA4
extern volatile uint32_t   C2FIFOUA4 __attribute__((section("sfrs"), address(0xBF88C470)));
extern volatile uint32_t        C2FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF88C474)));
extern volatile uint32_t        C2FIFOUA4SET __attribute__((section("sfrs"),address(0xBF88C478)));
extern volatile uint32_t        C2FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88C47C)));
#define C2FIFOCI4 C2FIFOCI4
extern volatile uint32_t   C2FIFOCI4 __attribute__((section("sfrs"), address(0xBF88C480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI4bits_t;
extern volatile __C2FIFOCI4bits_t C2FIFOCI4bits __asm__ ("C2FIFOCI4") __attribute__((section("sfrs"), address(0xBF88C480)));
extern volatile uint32_t        C2FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF88C484)));
extern volatile uint32_t        C2FIFOCI4SET __attribute__((section("sfrs"),address(0xBF88C488)));
extern volatile uint32_t        C2FIFOCI4INV __attribute__((section("sfrs"),address(0xBF88C48C)));
#define C2FIFOCON5 C2FIFOCON5
extern volatile uint32_t   C2FIFOCON5 __attribute__((section("sfrs"), address(0xBF88C490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON5bits_t;
extern volatile __C2FIFOCON5bits_t C2FIFOCON5bits __asm__ ("C2FIFOCON5") __attribute__((section("sfrs"), address(0xBF88C490)));
extern volatile uint32_t        C2FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF88C494)));
extern volatile uint32_t        C2FIFOCON5SET __attribute__((section("sfrs"),address(0xBF88C498)));
extern volatile uint32_t        C2FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88C49C)));
#define C2FIFOINT5 C2FIFOINT5
extern volatile uint32_t   C2FIFOINT5 __attribute__((section("sfrs"), address(0xBF88C4A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT5bits_t;
extern volatile __C2FIFOINT5bits_t C2FIFOINT5bits __asm__ ("C2FIFOINT5") __attribute__((section("sfrs"), address(0xBF88C4A0)));
extern volatile uint32_t        C2FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF88C4A4)));
extern volatile uint32_t        C2FIFOINT5SET __attribute__((section("sfrs"),address(0xBF88C4A8)));
extern volatile uint32_t        C2FIFOINT5INV __attribute__((section("sfrs"),address(0xBF88C4AC)));
#define C2FIFOUA5 C2FIFOUA5
extern volatile uint32_t   C2FIFOUA5 __attribute__((section("sfrs"), address(0xBF88C4B0)));
extern volatile uint32_t        C2FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF88C4B4)));
extern volatile uint32_t        C2FIFOUA5SET __attribute__((section("sfrs"),address(0xBF88C4B8)));
extern volatile uint32_t        C2FIFOUA5INV __attribute__((section("sfrs"),address(0xBF88C4BC)));
#define C2FIFOCI5 C2FIFOCI5
extern volatile uint32_t   C2FIFOCI5 __attribute__((section("sfrs"), address(0xBF88C4C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI5bits_t;
extern volatile __C2FIFOCI5bits_t C2FIFOCI5bits __asm__ ("C2FIFOCI5") __attribute__((section("sfrs"), address(0xBF88C4C0)));
extern volatile uint32_t        C2FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF88C4C4)));
extern volatile uint32_t        C2FIFOCI5SET __attribute__((section("sfrs"),address(0xBF88C4C8)));
extern volatile uint32_t        C2FIFOCI5INV __attribute__((section("sfrs"),address(0xBF88C4CC)));
#define C2FIFOCON6 C2FIFOCON6
extern volatile uint32_t   C2FIFOCON6 __attribute__((section("sfrs"), address(0xBF88C4D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON6bits_t;
extern volatile __C2FIFOCON6bits_t C2FIFOCON6bits __asm__ ("C2FIFOCON6") __attribute__((section("sfrs"), address(0xBF88C4D0)));
extern volatile uint32_t        C2FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF88C4D4)));
extern volatile uint32_t        C2FIFOCON6SET __attribute__((section("sfrs"),address(0xBF88C4D8)));
extern volatile uint32_t        C2FIFOCON6INV __attribute__((section("sfrs"),address(0xBF88C4DC)));
#define C2FIFOINT6 C2FIFOINT6
extern volatile uint32_t   C2FIFOINT6 __attribute__((section("sfrs"), address(0xBF88C4E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT6bits_t;
extern volatile __C2FIFOINT6bits_t C2FIFOINT6bits __asm__ ("C2FIFOINT6") __attribute__((section("sfrs"), address(0xBF88C4E0)));
extern volatile uint32_t        C2FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF88C4E4)));
extern volatile uint32_t        C2FIFOINT6SET __attribute__((section("sfrs"),address(0xBF88C4E8)));
extern volatile uint32_t        C2FIFOINT6INV __attribute__((section("sfrs"),address(0xBF88C4EC)));
#define C2FIFOUA6 C2FIFOUA6
extern volatile uint32_t   C2FIFOUA6 __attribute__((section("sfrs"), address(0xBF88C4F0)));
extern volatile uint32_t        C2FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF88C4F4)));
extern volatile uint32_t        C2FIFOUA6SET __attribute__((section("sfrs"),address(0xBF88C4F8)));
extern volatile uint32_t        C2FIFOUA6INV __attribute__((section("sfrs"),address(0xBF88C4FC)));
#define C2FIFOCI6 C2FIFOCI6
extern volatile uint32_t   C2FIFOCI6 __attribute__((section("sfrs"), address(0xBF88C500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI6bits_t;
