MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
extern volatile __C2FIFOCI6bits_t C2FIFOCI6bits __asm__ ("C2FIFOCI6") __attribute__((section("sfrs"), address(0xBF88C500)));
extern volatile uint32_t        C2FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF88C504)));
extern volatile uint32_t        C2FIFOCI6SET __attribute__((section("sfrs"),address(0xBF88C508)));
extern volatile uint32_t        C2FIFOCI6INV __attribute__((section("sfrs"),address(0xBF88C50C)));
#define C2FIFOCON7 C2FIFOCON7
extern volatile uint32_t   C2FIFOCON7 __attribute__((section("sfrs"), address(0xBF88C510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON7bits_t;
extern volatile __C2FIFOCON7bits_t C2FIFOCON7bits __asm__ ("C2FIFOCON7") __attribute__((section("sfrs"), address(0xBF88C510)));
extern volatile uint32_t        C2FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF88C514)));
extern volatile uint32_t        C2FIFOCON7SET __attribute__((section("sfrs"),address(0xBF88C518)));
extern volatile uint32_t        C2FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88C51C)));
#define C2FIFOINT7 C2FIFOINT7
extern volatile uint32_t   C2FIFOINT7 __attribute__((section("sfrs"), address(0xBF88C520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT7bits_t;
extern volatile __C2FIFOINT7bits_t C2FIFOINT7bits __asm__ ("C2FIFOINT7") __attribute__((section("sfrs"), address(0xBF88C520)));
extern volatile uint32_t        C2FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF88C524)));
extern volatile uint32_t        C2FIFOINT7SET __attribute__((section("sfrs"),address(0xBF88C528)));
extern volatile uint32_t        C2FIFOINT7INV __attribute__((section("sfrs"),address(0xBF88C52C)));
#define C2FIFOUA7 C2FIFOUA7
extern volatile uint32_t   C2FIFOUA7 __attribute__((section("sfrs"), address(0xBF88C530)));
extern volatile uint32_t        C2FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF88C534)));
extern volatile uint32_t        C2FIFOUA7SET __attribute__((section("sfrs"),address(0xBF88C538)));
extern volatile uint32_t        C2FIFOUA7INV __attribute__((section("sfrs"),address(0xBF88C53C)));
#define C2FIFOCI7 C2FIFOCI7
extern volatile uint32_t   C2FIFOCI7 __attribute__((section("sfrs"), address(0xBF88C540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI7bits_t;
extern volatile __C2FIFOCI7bits_t C2FIFOCI7bits __asm__ ("C2FIFOCI7") __attribute__((section("sfrs"), address(0xBF88C540)));
extern volatile uint32_t        C2FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF88C544)));
extern volatile uint32_t        C2FIFOCI7SET __attribute__((section("sfrs"),address(0xBF88C548)));
extern volatile uint32_t        C2FIFOCI7INV __attribute__((section("sfrs"),address(0xBF88C54C)));
#define C2FIFOCON8 C2FIFOCON8
extern volatile uint32_t   C2FIFOCON8 __attribute__((section("sfrs"), address(0xBF88C550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON8bits_t;
extern volatile __C2FIFOCON8bits_t C2FIFOCON8bits __asm__ ("C2FIFOCON8") __attribute__((section("sfrs"), address(0xBF88C550)));
extern volatile uint32_t        C2FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF88C554)));
extern volatile uint32_t        C2FIFOCON8SET __attribute__((section("sfrs"),address(0xBF88C558)));
extern volatile uint32_t        C2FIFOCON8INV __attribute__((section("sfrs"),address(0xBF88C55C)));
#define C2FIFOINT8 C2FIFOINT8
extern volatile uint32_t   C2FIFOINT8 __attribute__((section("sfrs"), address(0xBF88C560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT8bits_t;
extern volatile __C2FIFOINT8bits_t C2FIFOINT8bits __asm__ ("C2FIFOINT8") __attribute__((section("sfrs"), address(0xBF88C560)));
extern volatile uint32_t        C2FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF88C564)));
extern volatile uint32_t        C2FIFOINT8SET __attribute__((section("sfrs"),address(0xBF88C568)));
extern volatile uint32_t        C2FIFOINT8INV __attribute__((section("sfrs"),address(0xBF88C56C)));
#define C2FIFOUA8 C2FIFOUA8
extern volatile uint32_t   C2FIFOUA8 __attribute__((section("sfrs"), address(0xBF88C570)));
extern volatile uint32_t        C2FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF88C574)));
extern volatile uint32_t        C2FIFOUA8SET __attribute__((section("sfrs"),address(0xBF88C578)));
extern volatile uint32_t        C2FIFOUA8INV __attribute__((section("sfrs"),address(0xBF88C57C)));
#define C2FIFOCI8 C2FIFOCI8
extern volatile uint32_t   C2FIFOCI8 __attribute__((section("sfrs"), address(0xBF88C580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI8bits_t;
