MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
extern volatile __C2FIFOCI13bits_t C2FIFOCI13bits __asm__ ("C2FIFOCI13") __attribute__((section("sfrs"), address(0xBF88C6C0)));
extern volatile uint32_t        C2FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF88C6C4)));
extern volatile uint32_t        C2FIFOCI13SET __attribute__((section("sfrs"),address(0xBF88C6C8)));
extern volatile uint32_t        C2FIFOCI13INV __attribute__((section("sfrs"),address(0xBF88C6CC)));
#define C2FIFOCON14 C2FIFOCON14
extern volatile uint32_t   C2FIFOCON14 __attribute__((section("sfrs"), address(0xBF88C6D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON14bits_t;
extern volatile __C2FIFOCON14bits_t C2FIFOCON14bits __asm__ ("C2FIFOCON14") __attribute__((section("sfrs"), address(0xBF88C6D0)));
extern volatile uint32_t        C2FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF88C6D4)));
extern volatile uint32_t        C2FIFOCON14SET __attribute__((section("sfrs"),address(0xBF88C6D8)));
extern volatile uint32_t        C2FIFOCON14INV __attribute__((section("sfrs"),address(0xBF88C6DC)));
#define C2FIFOINT14 C2FIFOINT14
extern volatile uint32_t   C2FIFOINT14 __attribute__((section("sfrs"), address(0xBF88C6E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT14bits_t;
extern volatile __C2FIFOINT14bits_t C2FIFOINT14bits __asm__ ("C2FIFOINT14") __attribute__((section("sfrs"), address(0xBF88C6E0)));
extern volatile uint32_t        C2FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF88C6E4)));
extern volatile uint32_t        C2FIFOINT14SET __attribute__((section("sfrs"),address(0xBF88C6E8)));
extern volatile uint32_t        C2FIFOINT14INV __attribute__((section("sfrs"),address(0xBF88C6EC)));
#define C2FIFOUA14 C2FIFOUA14
extern volatile uint32_t   C2FIFOUA14 __attribute__((section("sfrs"), address(0xBF88C6F0)));
extern volatile uint32_t        C2FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF88C6F4)));
extern volatile uint32_t        C2FIFOUA14SET __attribute__((section("sfrs"),address(0xBF88C6F8)));
extern volatile uint32_t        C2FIFOUA14INV __attribute__((section("sfrs"),address(0xBF88C6FC)));
#define C2FIFOCI14 C2FIFOCI14
extern volatile uint32_t   C2FIFOCI14 __attribute__((section("sfrs"), address(0xBF88C700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI14bits_t;
extern volatile __C2FIFOCI14bits_t C2FIFOCI14bits __asm__ ("C2FIFOCI14") __attribute__((section("sfrs"), address(0xBF88C700)));
extern volatile uint32_t        C2FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF88C704)));
extern volatile uint32_t        C2FIFOCI14SET __attribute__((section("sfrs"),address(0xBF88C708)));
extern volatile uint32_t        C2FIFOCI14INV __attribute__((section("sfrs"),address(0xBF88C70C)));
#define C2FIFOCON15 C2FIFOCON15
extern volatile uint32_t   C2FIFOCON15 __attribute__((section("sfrs"), address(0xBF88C710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON15bits_t;
extern volatile __C2FIFOCON15bits_t C2FIFOCON15bits __asm__ ("C2FIFOCON15") __attribute__((section("sfrs"), address(0xBF88C710)));
extern volatile uint32_t        C2FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF88C714)));
extern volatile uint32_t        C2FIFOCON15SET __attribute__((section("sfrs"),address(0xBF88C718)));
extern volatile uint32_t        C2FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88C71C)));
#define C2FIFOINT15 C2FIFOINT15
extern volatile uint32_t   C2FIFOINT15 __attribute__((section("sfrs"), address(0xBF88C720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT15bits_t;
extern volatile __C2FIFOINT15bits_t C2FIFOINT15bits __asm__ ("C2FIFOINT15") __attribute__((section("sfrs"), address(0xBF88C720)));
extern volatile uint32_t        C2FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF88C724)));
extern volatile uint32_t        C2FIFOINT15SET __attribute__((section("sfrs"),address(0xBF88C728)));
extern volatile uint32_t        C2FIFOINT15INV __attribute__((section("sfrs"),address(0xBF88C72C)));
#define C2FIFOUA15 C2FIFOUA15
extern volatile uint32_t   C2FIFOUA15 __attribute__((section("sfrs"), address(0xBF88C730)));
extern volatile uint32_t        C2FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF88C734)));
extern volatile uint32_t        C2FIFOUA15SET __attribute__((section("sfrs"),address(0xBF88C738)));
extern volatile uint32_t        C2FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88C73C)));
#define C2FIFOCI15 C2FIFOCI15
extern volatile uint32_t   C2FIFOCI15 __attribute__((section("sfrs"), address(0xBF88C740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI15bits_t;
extern volatile __C2FIFOCI15bits_t C2FIFOCI15bits __asm__ ("C2FIFOCI15") __attribute__((section("sfrs"), address(0xBF88C740)));
extern volatile uint32_t        C2FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF88C744)));
extern volatile uint32_t        C2FIFOCI15SET __attribute__((section("sfrs"),address(0xBF88C748)));
extern volatile uint32_t        C2FIFOCI15INV __attribute__((section("sfrs"),address(0xBF88C74C)));
#define C2FIFOCON16 C2FIFOCON16
extern volatile uint32_t   C2FIFOCON16 __attribute__((section("sfrs"), address(0xBF88C750)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON16bits_t;
extern volatile __C2FIFOCON16bits_t C2FIFOCON16bits __asm__ ("C2FIFOCON16") __attribute__((section("sfrs"), address(0xBF88C750)));
extern volatile uint32_t        C2FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF88C754)));
extern volatile uint32_t        C2FIFOCON16SET __attribute__((section("sfrs"),address(0xBF88C758)));
extern volatile uint32_t        C2FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88C75C)));
#define C2FIFOINT16 C2FIFOINT16
extern volatile uint32_t   C2FIFOINT16 __attribute__((section("sfrs"), address(0xBF88C760)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT16bits_t;
extern volatile __C2FIFOINT16bits_t C2FIFOINT16bits __asm__ ("C2FIFOINT16") __attribute__((section("sfrs"), address(0xBF88C760)));
extern volatile uint32_t        C2FIFOINT16CLR __attribute__((section("sfrs"),address(0xBF88C764)));
extern volatile uint32_t        C2FIFOINT16SET __attribute__((section("sfrs"),address(0xBF88C768)));
extern volatile uint32_t        C2FIFOINT16INV __attribute__((section("sfrs"),address(0xBF88C76C)));
#define C2FIFOUA16 C2FIFOUA16
extern volatile uint32_t   C2FIFOUA16 __attribute__((section("sfrs"), address(0xBF88C770)));
extern volatile uint32_t        C2FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF88C774)));
extern volatile uint32_t        C2FIFOUA16SET __attribute__((section("sfrs"),address(0xBF88C778)));
extern volatile uint32_t        C2FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88C77C)));
#define C2FIFOCI16 C2FIFOCI16
extern volatile uint32_t   C2FIFOCI16 __attribute__((section("sfrs"), address(0xBF88C780)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI16bits_t;
extern volatile __C2FIFOCI16bits_t C2FIFOCI16bits __asm__ ("C2FIFOCI16") __attribute__((section("sfrs"), address(0xBF88C780)));
extern volatile uint32_t        C2FIFOCI16CLR __attribute__((section("sfrs"),address(0xBF88C784)));
extern volatile uint32_t        C2FIFOCI16SET __attribute__((section("sfrs"),address(0xBF88C788)));
extern volatile uint32_t        C2FIFOCI16INV __attribute__((section("sfrs"),address(0xBF88C78C)));
#define C2FIFOCON17 C2FIFOCON17
extern volatile uint32_t   C2FIFOCON17 __attribute__((section("sfrs"), address(0xBF88C790)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON17bits_t;
