MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
  .extern C1FIFOCON4CLR    /* 0xBF88B454 */
  .extern C1FIFOCON4SET    /* 0xBF88B458 */
  .extern C1FIFOCON4INV    /* 0xBF88B45C */
  .extern C1FIFOINT4       /* 0xBF88B460 */
  .extern C1FIFOINT4CLR    /* 0xBF88B464 */
  .extern C1FIFOINT4SET    /* 0xBF88B468 */
  .extern C1FIFOINT4INV    /* 0xBF88B46C */
  .extern C1FIFOUA4        /* 0xBF88B470 */
  .extern C1FIFOUA4CLR     /* 0xBF88B474 */
  .extern C1FIFOUA4SET     /* 0xBF88B478 */
  .extern C1FIFOUA4INV     /* 0xBF88B47C */
  .extern C1FIFOCI4        /* 0xBF88B480 */
  .extern C1FIFOCI4CLR     /* 0xBF88B484 */
  .extern C1FIFOCI4SET     /* 0xBF88B488 */
  .extern C1FIFOCI4INV     /* 0xBF88B48C */
  .extern C1FIFOCON5       /* 0xBF88B490 */
  .extern C1FIFOCON5CLR    /* 0xBF88B494 */
  .extern C1FIFOCON5SET    /* 0xBF88B498 */
  .extern C1FIFOCON5INV    /* 0xBF88B49C */
  .extern C1FIFOINT5       /* 0xBF88B4A0 */
  .extern C1FIFOINT5CLR    /* 0xBF88B4A4 */
  .extern C1FIFOINT5SET    /* 0xBF88B4A8 */
  .extern C1FIFOINT5INV    /* 0xBF88B4AC */
  .extern C1FIFOUA5        /* 0xBF88B4B0 */
  .extern C1FIFOUA5CLR     /* 0xBF88B4B4 */
  .extern C1FIFOUA5SET     /* 0xBF88B4B8 */
  .extern C1FIFOUA5INV     /* 0xBF88B4BC */
  .extern C1FIFOCI5        /* 0xBF88B4C0 */
  .extern C1FIFOCI5CLR     /* 0xBF88B4C4 */
  .extern C1FIFOCI5SET     /* 0xBF88B4C8 */
  .extern C1FIFOCI5INV     /* 0xBF88B4CC */
  .extern C1FIFOCON6       /* 0xBF88B4D0 */
  .extern C1FIFOCON6CLR    /* 0xBF88B4D4 */
  .extern C1FIFOCON6SET    /* 0xBF88B4D8 */
  .extern C1FIFOCON6INV    /* 0xBF88B4DC */
  .extern C1FIFOINT6       /* 0xBF88B4E0 */
  .extern C1FIFOINT6CLR    /* 0xBF88B4E4 */
  .extern C1FIFOINT6SET    /* 0xBF88B4E8 */
  .extern C1FIFOINT6INV    /* 0xBF88B4EC */
  .extern C1FIFOUA6        /* 0xBF88B4F0 */
  .extern C1FIFOUA6CLR     /* 0xBF88B4F4 */
  .extern C1FIFOUA6SET     /* 0xBF88B4F8 */
  .extern C1FIFOUA6INV     /* 0xBF88B4FC */
  .extern C1FIFOCI6        /* 0xBF88B500 */
  .extern C1FIFOCI6CLR     /* 0xBF88B504 */
  .extern C1FIFOCI6SET     /* 0xBF88B508 */
  .extern C1FIFOCI6INV     /* 0xBF88B50C */
  .extern C1FIFOCON7       /* 0xBF88B510 */
  .extern C1FIFOCON7CLR    /* 0xBF88B514 */
  .extern C1FIFOCON7SET    /* 0xBF88B518 */
  .extern C1FIFOCON7INV    /* 0xBF88B51C */
  .extern C1FIFOINT7       /* 0xBF88B520 */
  .extern C1FIFOINT7CLR    /* 0xBF88B524 */
  .extern C1FIFOINT7SET    /* 0xBF88B528 */
  .extern C1FIFOINT7INV    /* 0xBF88B52C */
  .extern C1FIFOUA7        /* 0xBF88B530 */
  .extern C1FIFOUA7CLR     /* 0xBF88B534 */
  .extern C1FIFOUA7SET     /* 0xBF88B538 */
  .extern C1FIFOUA7INV     /* 0xBF88B53C */
  .extern C1FIFOCI7        /* 0xBF88B540 */
  .extern C1FIFOCI7CLR     /* 0xBF88B544 */
  .extern C1FIFOCI7SET     /* 0xBF88B548 */
  .extern C1FIFOCI7INV     /* 0xBF88B54C */
  .extern C1FIFOCON8       /* 0xBF88B550 */
  .extern C1FIFOCON8CLR    /* 0xBF88B554 */
  .extern C1FIFOCON8SET    /* 0xBF88B558 */
  .extern C1FIFOCON8INV    /* 0xBF88B55C */
  .extern C1FIFOINT8       /* 0xBF88B560 */
  .extern C1FIFOINT8CLR    /* 0xBF88B564 */
  .extern C1FIFOINT8SET    /* 0xBF88B568 */
  .extern C1FIFOINT8INV    /* 0xBF88B56C */
  .extern C1FIFOUA8        /* 0xBF88B570 */
  .extern C1FIFOUA8CLR     /* 0xBF88B574 */
  .extern C1FIFOUA8SET     /* 0xBF88B578 */
  .extern C1FIFOUA8INV     /* 0xBF88B57C */
  .extern C1FIFOCI8        /* 0xBF88B580 */
  .extern C1FIFOCI8CLR     /* 0xBF88B584 */
  .extern C1FIFOCI8SET     /* 0xBF88B588 */
  .extern C1FIFOCI8INV     /* 0xBF88B58C */
  .extern C1FIFOCON9       /* 0xBF88B590 */
  .extern C1FIFOCON9CLR    /* 0xBF88B594 */
  .extern C1FIFOCON9SET    /* 0xBF88B598 */
  .extern C1FIFOCON9INV    /* 0xBF88B59C */
  .extern C1FIFOINT9       /* 0xBF88B5A0 */
  .extern C1FIFOINT9CLR    /* 0xBF88B5A4 */
  .extern C1FIFOINT9SET    /* 0xBF88B5A8 */
  .extern C1FIFOINT9INV    /* 0xBF88B5AC */
  .extern C1FIFOUA9        /* 0xBF88B5B0 */
  .extern C1FIFOUA9CLR     /* 0xBF88B5B4 */
  .extern C1FIFOUA9SET     /* 0xBF88B5B8 */
  .extern C1FIFOUA9INV     /* 0xBF88B5BC */
  .extern C1FIFOCI9        /* 0xBF88B5C0 */
  .extern C1FIFOCI9CLR     /* 0xBF88B5C4 */
  .extern C1FIFOCI9SET     /* 0xBF88B5C8 */
  .extern C1FIFOCI9INV     /* 0xBF88B5CC */
  .extern C1FIFOCON10      /* 0xBF88B5D0 */
  .extern C1FIFOCON10CLR   /* 0xBF88B5D4 */
  .extern C1FIFOCON10SET   /* 0xBF88B5D8 */
  .extern C1FIFOCON10INV   /* 0xBF88B5DC */
  .extern C1FIFOINT10      /* 0xBF88B5E0 */
  .extern C1FIFOINT10CLR   /* 0xBF88B5E4 */
  .extern C1FIFOINT10SET   /* 0xBF88B5E8 */
  .extern C1FIFOINT10INV   /* 0xBF88B5EC */
  .extern C1FIFOUA10       /* 0xBF88B5F0 */
  .extern C1FIFOUA10CLR    /* 0xBF88B5F4 */
  .extern C1FIFOUA10SET    /* 0xBF88B5F8 */
  .extern C1FIFOUA10INV    /* 0xBF88B5FC */
  .extern C1FIFOCI10       /* 0xBF88B600 */
  .extern C1FIFOCI10CLR    /* 0xBF88B604 */
  .extern C1FIFOCI10SET    /* 0xBF88B608 */
  .extern C1FIFOCI10INV    /* 0xBF88B60C */
  .extern C1FIFOCON11      /* 0xBF88B610 */
  .extern C1FIFOCON11CLR   /* 0xBF88B614 */
  .extern C1FIFOCON11SET   /* 0xBF88B618 */
  .extern C1FIFOCON11INV   /* 0xBF88B61C */
  .extern C1FIFOINT11      /* 0xBF88B620 */
  .extern C1FIFOINT11CLR   /* 0xBF88B624 */
  .extern C1FIFOINT11SET   /* 0xBF88B628 */
  .extern C1FIFOINT11INV   /* 0xBF88B62C */
  .extern C1FIFOUA11       /* 0xBF88B630 */
  .extern C1FIFOUA11CLR    /* 0xBF88B634 */
  .extern C1FIFOUA11SET    /* 0xBF88B638 */
  .extern C1FIFOUA11INV    /* 0xBF88B63C */
  .extern C1FIFOCI11       /* 0xBF88B640 */
  .extern C1FIFOCI11CLR    /* 0xBF88B644 */
  .extern C1FIFOCI11SET    /* 0xBF88B648 */
  .extern C1FIFOCI11INV    /* 0xBF88B64C */
  .extern C1FIFOCON12      /* 0xBF88B650 */
  .extern C1FIFOCON12CLR   /* 0xBF88B654 */
  .extern C1FIFOCON12SET   /* 0xBF88B658 */
  .extern C1FIFOCON12INV   /* 0xBF88B65C */
  .extern C1FIFOINT12      /* 0xBF88B660 */
  .extern C1FIFOINT12CLR   /* 0xBF88B664 */
  .extern C1FIFOINT12SET   /* 0xBF88B668 */
  .extern C1FIFOINT12INV   /* 0xBF88B66C */
  .extern C1FIFOUA12       /* 0xBF88B670 */
  .extern C1FIFOUA12CLR    /* 0xBF88B674 */
  .extern C1FIFOUA12SET    /* 0xBF88B678 */
  .extern C1FIFOUA12INV    /* 0xBF88B67C */
  .extern C1FIFOCI12       /* 0xBF88B680 */
  .extern C1FIFOCI12CLR    /* 0xBF88B684 */
  .extern C1FIFOCI12SET    /* 0xBF88B688 */
  .extern C1FIFOCI12INV    /* 0xBF88B68C */
  .extern C1FIFOCON13      /* 0xBF88B690 */
  .extern C1FIFOCON13CLR   /* 0xBF88B694 */
  .extern C1FIFOCON13SET   /* 0xBF88B698 */
  .extern C1FIFOCON13INV   /* 0xBF88B69C */
  .extern C1FIFOINT13      /* 0xBF88B6A0 */
  .extern C1FIFOINT13CLR   /* 0xBF88B6A4 */
  .extern C1FIFOINT13SET   /* 0xBF88B6A8 */
  .extern C1FIFOINT13INV   /* 0xBF88B6AC */
  .extern C1FIFOUA13       /* 0xBF88B6B0 */
  .extern C1FIFOUA13CLR    /* 0xBF88B6B4 */
  .extern C1FIFOUA13SET    /* 0xBF88B6B8 */
  .extern C1FIFOUA13INV    /* 0xBF88B6BC */
  .extern C1FIFOCI13       /* 0xBF88B6C0 */
  .extern C1FIFOCI13CLR    /* 0xBF88B6C4 */
  .extern C1FIFOCI13SET    /* 0xBF88B6C8 */
  .extern C1FIFOCI13INV    /* 0xBF88B6CC */
  .extern C1FIFOCON14      /* 0xBF88B6D0 */
  .extern C1FIFOCON14CLR   /* 0xBF88B6D4 */
  .extern C1FIFOCON14SET   /* 0xBF88B6D8 */
  .extern C1FIFOCON14INV   /* 0xBF88B6DC */
  .extern C1FIFOINT14      /* 0xBF88B6E0 */
  .extern C1FIFOINT14CLR   /* 0xBF88B6E4 */
  .extern C1FIFOINT14SET   /* 0xBF88B6E8 */
  .extern C1FIFOINT14INV   /* 0xBF88B6EC */
  .extern C1FIFOUA14       /* 0xBF88B6F0 */
  .extern C1FIFOUA14CLR    /* 0xBF88B6F4 */
  .extern C1FIFOUA14SET    /* 0xBF88B6F8 */
  .extern C1FIFOUA14INV    /* 0xBF88B6FC */
  .extern C1FIFOCI14       /* 0xBF88B700 */
  .extern C1FIFOCI14CLR    /* 0xBF88B704 */
  .extern C1FIFOCI14SET    /* 0xBF88B708 */
  .extern C1FIFOCI14INV    /* 0xBF88B70C */
  .extern C1FIFOCON15      /* 0xBF88B710 */
  .extern C1FIFOCON15CLR   /* 0xBF88B714 */
  .extern C1FIFOCON15SET   /* 0xBF88B718 */
  .extern C1FIFOCON15INV   /* 0xBF88B71C */
  .extern C1FIFOINT15      /* 0xBF88B720 */
  .extern C1FIFOINT15CLR   /* 0xBF88B724 */
  .extern C1FIFOINT15SET   /* 0xBF88B728 */
  .extern C1FIFOINT15INV   /* 0xBF88B72C */
  .extern C1FIFOUA15       /* 0xBF88B730 */
  .extern C1FIFOUA15CLR    /* 0xBF88B734 */
  .extern C1FIFOUA15SET    /* 0xBF88B738 */
  .extern C1FIFOUA15INV    /* 0xBF88B73C */
  .extern C1FIFOCI15       /* 0xBF88B740 */
  .extern C1FIFOCI15CLR    /* 0xBF88B744 */
  .extern C1FIFOCI15SET    /* 0xBF88B748 */
  .extern C1FIFOCI15INV    /* 0xBF88B74C */
  .extern C1FIFOCON16      /* 0xBF88B750 */
  .extern C1FIFOCON16CLR   /* 0xBF88B754 */
  .extern C1FIFOCON16SET   /* 0xBF88B758 */
  .extern C1FIFOCON16INV   /* 0xBF88B75C */
  .extern C1FIFOINT16      /* 0xBF88B760 */
  .extern C1FIFOINT16CLR   /* 0xBF88B764 */
  .extern C1FIFOINT16SET   /* 0xBF88B768 */
  .extern C1FIFOINT16INV   /* 0xBF88B76C */
  .extern C1FIFOUA16       /* 0xBF88B770 */
  .extern C1FIFOUA16CLR    /* 0xBF88B774 */
  .extern C1FIFOUA16SET    /* 0xBF88B778 */
  .extern C1FIFOUA16INV    /* 0xBF88B77C */
  .extern C1FIFOCI16       /* 0xBF88B780 */
  .extern C1FIFOCI16CLR    /* 0xBF88B784 */
  .extern C1FIFOCI16SET    /* 0xBF88B788 */
  .extern C1FIFOCI16INV    /* 0xBF88B78C */
  .extern C1FIFOCON17      /* 0xBF88B790 */
  .extern C1FIFOCON17CLR   /* 0xBF88B794 */
  .extern C1FIFOCON17SET   /* 0xBF88B798 */
  .extern C1FIFOCON17INV   /* 0xBF88B79C */
  .extern C1FIFOINT17      /* 0xBF88B7A0 */
  .extern C1FIFOINT17CLR   /* 0xBF88B7A4 */
  .extern C1FIFOINT17SET   /* 0xBF88B7A8 */
  .extern C1FIFOINT17INV   /* 0xBF88B7AC */
  .extern C1FIFOUA17       /* 0xBF88B7B0 */
  .extern C1FIFOUA17CLR    /* 0xBF88B7B4 */
  .extern C1FIFOUA17SET    /* 0xBF88B7B8 */
  .extern C1FIFOUA17INV    /* 0xBF88B7BC */
  .extern C1FIFOCI17       /* 0xBF88B7C0 */
  .extern C1FIFOCI17CLR    /* 0xBF88B7C4 */
  .extern C1FIFOCI17SET    /* 0xBF88B7C8 */
  .extern C1FIFOCI17INV    /* 0xBF88B7CC */
  .extern C1FIFOCON18      /* 0xBF88B7D0 */
  .extern C1FIFOCON18CLR   /* 0xBF88B7D4 */
  .extern C1FIFOCON18SET   /* 0xBF88B7D8 */
  .extern C1FIFOCON18INV   /* 0xBF88B7DC */
  .extern C1FIFOINT18      /* 0xBF88B7E0 */
  .extern C1FIFOINT18CLR   /* 0xBF88B7E4 */
  .extern C1FIFOINT18SET   /* 0xBF88B7E8 */
  .extern C1FIFOINT18INV   /* 0xBF88B7EC */
  .extern C1FIFOUA18       /* 0xBF88B7F0 */
  .extern C1FIFOUA18CLR    /* 0xBF88B7F4 */
  .extern C1FIFOUA18SET    /* 0xBF88B7F8 */
  .extern C1FIFOUA18INV    /* 0xBF88B7FC */
  .extern C1FIFOCI18       /* 0xBF88B800 */
  .extern C1FIFOCI18CLR    /* 0xBF88B804 */
  .extern C1FIFOCI18SET    /* 0xBF88B808 */
  .extern C1FIFOCI18INV    /* 0xBF88B80C */
  .extern C1FIFOCON19      /* 0xBF88B810 */
  .extern C1FIFOCON19CLR   /* 0xBF88B814 */
  .extern C1FIFOCON19SET   /* 0xBF88B818 */
  .extern C1FIFOCON19INV   /* 0xBF88B81C */
  .extern C1FIFOINT19      /* 0xBF88B820 */
  .extern C1FIFOINT19CLR   /* 0xBF88B824 */
  .extern C1FIFOINT19SET   /* 0xBF88B828 */
  .extern C1FIFOINT19INV   /* 0xBF88B82C */
  .extern C1FIFOUA19       /* 0xBF88B830 */
  .extern C1FIFOUA19CLR    /* 0xBF88B834 */
  .extern C1FIFOUA19SET    /* 0xBF88B838 */
  .extern C1FIFOUA19INV    /* 0xBF88B83C */
  .extern C1FIFOCI19       /* 0xBF88B840 */
  .extern C1FIFOCI19CLR    /* 0xBF88B844 */
  .extern C1FIFOCI19SET    /* 0xBF88B848 */
  .extern C1FIFOCI19INV    /* 0xBF88B84C */
  .extern C1FIFOCON20      /* 0xBF88B850 */
  .extern C1FIFOCON20CLR   /* 0xBF88B854 */
  .extern C1FIFOCON20SET   /* 0xBF88B858 */
  .extern C1FIFOCON20INV   /* 0xBF88B85C */
  .extern C1FIFOINT20      /* 0xBF88B860 */
  .extern C1FIFOINT20CLR   /* 0xBF88B864 */
  .extern C1FIFOINT20SET   /* 0xBF88B868 */
  .extern C1FIFOINT20INV   /* 0xBF88B86C */
  .extern C1FIFOUA20       /* 0xBF88B870 */
  .extern C1FIFOUA20CLR    /* 0xBF88B874 */
  .extern C1FIFOUA20SET    /* 0xBF88B878 */
  .extern C1FIFOUA20INV    /* 0xBF88B87C */
  .extern C1FIFOCI20       /* 0xBF88B880 */
  .extern C1FIFOCI20CLR    /* 0xBF88B884 */
  .extern C1FIFOCI20SET    /* 0xBF88B888 */
  .extern C1FIFOCI20INV    /* 0xBF88B88C */
  .extern C1FIFOCON21      /* 0xBF88B890 */
  .extern C1FIFOCON21CLR   /* 0xBF88B894 */
  .extern C1FIFOCON21SET   /* 0xBF88B898 */
  .extern C1FIFOCON21INV   /* 0xBF88B89C */
  .extern C1FIFOINT21      /* 0xBF88B8A0 */
  .extern C1FIFOINT21CLR   /* 0xBF88B8A4 */
  .extern C1FIFOINT21SET   /* 0xBF88B8A8 */
  .extern C1FIFOINT21INV   /* 0xBF88B8AC */
  .extern C1FIFOUA21       /* 0xBF88B8B0 */
  .extern C1FIFOUA21CLR    /* 0xBF88B8B4 */
  .extern C1FIFOUA21SET    /* 0xBF88B8B8 */
  .extern C1FIFOUA21INV    /* 0xBF88B8BC */
  .extern C1FIFOCI21       /* 0xBF88B8C0 */
  .extern C1FIFOCI21CLR    /* 0xBF88B8C4 */
  .extern C1FIFOCI21SET    /* 0xBF88B8C8 */
  .extern C1FIFOCI21INV    /* 0xBF88B8CC */
  .extern C1FIFOCON22      /* 0xBF88B8D0 */
  .extern C1FIFOCON22CLR   /* 0xBF88B8D4 */
  .extern C1FIFOCON22SET   /* 0xBF88B8D8 */
  .extern C1FIFOCON22INV   /* 0xBF88B8DC */
  .extern C1FIFOINT22      /* 0xBF88B8E0 */
  .extern C1FIFOINT22CLR   /* 0xBF88B8E4 */
  .extern C1FIFOINT22SET   /* 0xBF88B8E8 */
  .extern C1FIFOINT22INV   /* 0xBF88B8EC */
  .extern C1FIFOUA22       /* 0xBF88B8F0 */
  .extern C1FIFOUA22CLR    /* 0xBF88B8F4 */
  .extern C1FIFOUA22SET    /* 0xBF88B8F8 */
  .extern C1FIFOUA22INV    /* 0xBF88B8FC */
  .extern C1FIFOCI22       /* 0xBF88B900 */
  .extern C1FIFOCI22CLR    /* 0xBF88B904 */
  .extern C1FIFOCI22SET    /* 0xBF88B908 */
  .extern C1FIFOCI22INV    /* 0xBF88B90C */
  .extern C1FIFOCON23      /* 0xBF88B910 */
  .extern C1FIFOCON23CLR   /* 0xBF88B914 */
  .extern C1FIFOCON23SET   /* 0xBF88B918 */
  .extern C1FIFOCON23INV   /* 0xBF88B91C */
  .extern C1FIFOINT23      /* 0xBF88B920 */
  .extern C1FIFOINT23CLR   /* 0xBF88B924 */
  .extern C1FIFOINT23SET   /* 0xBF88B928 */
  .extern C1FIFOINT23INV   /* 0xBF88B92C */
  .extern C1FIFOUA23       /* 0xBF88B930 */
  .extern C1FIFOUA23CLR    /* 0xBF88B934 */
  .extern C1FIFOUA23SET    /* 0xBF88B938 */
  .extern C1FIFOUA23INV    /* 0xBF88B93C */
  .extern C1FIFOCI23       /* 0xBF88B940 */
  .extern C1FIFOCI23CLR    /* 0xBF88B944 */
  .extern C1FIFOCI23SET    /* 0xBF88B948 */
  .extern C1FIFOCI23INV    /* 0xBF88B94C */
  .extern C1FIFOCON24      /* 0xBF88B950 */
  .extern C1FIFOCON24CLR   /* 0xBF88B954 */
  .extern C1FIFOCON24SET   /* 0xBF88B958 */
  .extern C1FIFOCON24INV   /* 0xBF88B95C */
  .extern C1FIFOINT24      /* 0xBF88B960 */
  .extern C1FIFOINT24CLR   /* 0xBF88B964 */
  .extern C1FIFOINT24SET   /* 0xBF88B968 */
  .extern C1FIFOINT24INV   /* 0xBF88B96C */
  .extern C1FIFOUA24       /* 0xBF88B970 */
  .extern C1FIFOUA24CLR    /* 0xBF88B974 */
  .extern C1FIFOUA24SET    /* 0xBF88B978 */
  .extern C1FIFOUA24INV    /* 0xBF88B97C */
  .extern C1FIFOCI24       /* 0xBF88B980 */
  .extern C1FIFOCI24CLR    /* 0xBF88B984 */
  .extern C1FIFOCI24SET    /* 0xBF88B988 */
  .extern C1FIFOCI24INV    /* 0xBF88B98C */
  .extern C1FIFOCON25      /* 0xBF88B990 */
  .extern C1FIFOCON25CLR   /* 0xBF88B994 */
  .extern C1FIFOCON25SET   /* 0xBF88B998 */
  .extern C1FIFOCON25INV   /* 0xBF88B99C */
  .extern C1FIFOINT25      /* 0xBF88B9A0 */
  .extern C1FIFOINT25CLR   /* 0xBF88B9A4 */
  .extern C1FIFOINT25SET   /* 0xBF88B9A8 */
  .extern C1FIFOINT25INV   /* 0xBF88B9AC */
  .extern C1FIFOUA25       /* 0xBF88B9B0 */
  .extern C1FIFOUA25CLR    /* 0xBF88B9B4 */
  .extern C1FIFOUA25SET    /* 0xBF88B9B8 */
  .extern C1FIFOUA25INV    /* 0xBF88B9BC */
  .extern C1FIFOCI25       /* 0xBF88B9C0 */
  .extern C1FIFOCI25CLR    /* 0xBF88B9C4 */
  .extern C1FIFOCI25SET    /* 0xBF88B9C8 */
  .extern C1FIFOCI25INV    /* 0xBF88B9CC */
  .extern C1FIFOCON26      /* 0xBF88B9D0 */
  .extern C1FIFOCON26CLR   /* 0xBF88B9D4 */
  .extern C1FIFOCON26SET   /* 0xBF88B9D8 */
  .extern C1FIFOCON26INV   /* 0xBF88B9DC */
  .extern C1FIFOINT26      /* 0xBF88B9E0 */
  .extern C1FIFOINT26CLR   /* 0xBF88B9E4 */
  .extern C1FIFOINT26SET   /* 0xBF88B9E8 */
  .extern C1FIFOINT26INV   /* 0xBF88B9EC */
  .extern C1FIFOUA26       /* 0xBF88B9F0 */
  .extern C1FIFOUA26CLR    /* 0xBF88B9F4 */
  .extern C1FIFOUA26SET    /* 0xBF88B9F8 */
  .extern C1FIFOUA26INV    /* 0xBF88B9FC */
  .extern C1FIFOCI26       /* 0xBF88BA00 */
  .extern C1FIFOCI26CLR    /* 0xBF88BA04 */
  .extern C1FIFOCI26SET    /* 0xBF88BA08 */
  .extern C1FIFOCI26INV    /* 0xBF88BA0C */
  .extern C1FIFOCON27      /* 0xBF88BA10 */
  .extern C1FIFOCON27CLR   /* 0xBF88BA14 */
  .extern C1FIFOCON27SET   /* 0xBF88BA18 */
  .extern C1FIFOCON27INV   /* 0xBF88BA1C */
  .extern C1FIFOINT27      /* 0xBF88BA20 */
  .extern C1FIFOINT27CLR   /* 0xBF88BA24 */
  .extern C1FIFOINT27SET   /* 0xBF88BA28 */
  .extern C1FIFOINT27INV   /* 0xBF88BA2C */
  .extern C1FIFOUA27       /* 0xBF88BA30 */
  .extern C1FIFOUA27CLR    /* 0xBF88BA34 */
  .extern C1FIFOUA27SET    /* 0xBF88BA38 */
  .extern C1FIFOUA27INV    /* 0xBF88BA3C */
  .extern C1FIFOCI27       /* 0xBF88BA40 */
  .extern C1FIFOCI27CLR    /* 0xBF88BA44 */
  .extern C1FIFOCI27SET    /* 0xBF88BA48 */
  .extern C1FIFOCI27INV    /* 0xBF88BA4C */
  .extern C1FIFOCON28      /* 0xBF88BA50 */
  .extern C1FIFOCON28CLR   /* 0xBF88BA54 */
  .extern C1FIFOCON28SET   /* 0xBF88BA58 */
  .extern C1FIFOCON28INV   /* 0xBF88BA5C */
  .extern C1FIFOINT28      /* 0xBF88BA60 */
  .extern C1FIFOINT28CLR   /* 0xBF88BA64 */
  .extern C1FIFOINT28SET   /* 0xBF88BA68 */
  .extern C1FIFOINT28INV   /* 0xBF88BA6C */
  .extern C1FIFOUA28       /* 0xBF88BA70 */
  .extern C1FIFOUA28CLR    /* 0xBF88BA74 */
  .extern C1FIFOUA28SET    /* 0xBF88BA78 */
  .extern C1FIFOUA28INV    /* 0xBF88BA7C */
  .extern C1FIFOCI28       /* 0xBF88BA80 */
  .extern C1FIFOCI28CLR    /* 0xBF88BA84 */
  .extern C1FIFOCI28SET    /* 0xBF88BA88 */
  .extern C1FIFOCI28INV    /* 0xBF88BA8C */
  .extern C1FIFOCON29      /* 0xBF88BA90 */
  .extern C1FIFOCON29CLR   /* 0xBF88BA94 */
  .extern C1FIFOCON29SET   /* 0xBF88BA98 */
  .extern C1FIFOCON29INV   /* 0xBF88BA9C */
  .extern C1FIFOINT29      /* 0xBF88BAA0 */
  .extern C1FIFOINT29CLR   /* 0xBF88BAA4 */
  .extern C1FIFOINT29SET   /* 0xBF88BAA8 */
  .extern C1FIFOINT29INV   /* 0xBF88BAAC */
  .extern C1FIFOUA29       /* 0xBF88BAB0 */
  .extern C1FIFOUA29CLR    /* 0xBF88BAB4 */
  .extern C1FIFOUA29SET    /* 0xBF88BAB8 */
  .extern C1FIFOUA29INV    /* 0xBF88BABC */
  .extern C1FIFOCI29       /* 0xBF88BAC0 */
  .extern C1FIFOCI29CLR    /* 0xBF88BAC4 */
  .extern C1FIFOCI29SET    /* 0xBF88BAC8 */
  .extern C1FIFOCI29INV    /* 0xBF88BACC */
  .extern C1FIFOCON30      /* 0xBF88BAD0 */
  .extern C1FIFOCON30CLR   /* 0xBF88BAD4 */
  .extern C1FIFOCON30SET   /* 0xBF88BAD8 */
  .extern C1FIFOCON30INV   /* 0xBF88BADC */
  .extern C1FIFOINT30      /* 0xBF88BAE0 */
  .extern C1FIFOINT30CLR   /* 0xBF88BAE4 */
  .extern C1FIFOINT30SET   /* 0xBF88BAE8 */
  .extern C1FIFOINT30INV   /* 0xBF88BAEC */
  .extern C1FIFOUA30       /* 0xBF88BAF0 */
  .extern C1FIFOUA30CLR    /* 0xBF88BAF4 */
  .extern C1FIFOUA30SET    /* 0xBF88BAF8 */
  .extern C1FIFOUA30INV    /* 0xBF88BAFC */
  .extern C1FIFOCI30       /* 0xBF88BB00 */
  .extern C1FIFOCI30CLR    /* 0xBF88BB04 */
  .extern C1FIFOCI30SET    /* 0xBF88BB08 */
  .extern C1FIFOCI30INV    /* 0xBF88BB0C */
  .extern C1FIFOCON31      /* 0xBF88BB10 */
  .extern C1FIFOCON31CLR   /* 0xBF88BB14 */
  .extern C1FIFOCON31SET   /* 0xBF88BB18 */
  .extern C1FIFOCON31INV   /* 0xBF88BB1C */
  .extern C1FIFOINT31      /* 0xBF88BB20 */
  .extern C1FIFOINT31CLR   /* 0xBF88BB24 */
  .extern C1FIFOINT31SET   /* 0xBF88BB28 */
  .extern C1FIFOINT31INV   /* 0xBF88BB2C */
  .extern C1FIFOUA31       /* 0xBF88BB30 */
  .extern C1FIFOUA31CLR    /* 0xBF88BB34 */
  .extern C1FIFOUA31SET    /* 0xBF88BB38 */
  .extern C1FIFOUA31INV    /* 0xBF88BB3C */
  .extern C1FIFOCI31       /* 0xBF88BB40 */
  .extern C1FIFOCI31CLR    /* 0xBF88BB44 */
  .extern C1FIFOCI31SET    /* 0xBF88BB48 */
  .extern C1FIFOCI31INV    /* 0xBF88BB4C */
  .extern C2CON            /* 0xBF88C000 */
  .extern C2CONCLR         /* 0xBF88C004 */
  .extern C2CONSET         /* 0xBF88C008 */
  .extern C2CONINV         /* 0xBF88C00C */
  .extern C2CFG            /* 0xBF88C010 */
  .extern C2CFGCLR         /* 0xBF88C014 */
  .extern C2CFGSET         /* 0xBF88C018 */
  .extern C2CFGINV         /* 0xBF88C01C */
  .extern C2INT            /* 0xBF88C020 */
  .extern C2INTCLR         /* 0xBF88C024 */
  .extern C2INTSET         /* 0xBF88C028 */
  .extern C2INTINV         /* 0xBF88C02C */
  .extern C2VEC            /* 0xBF88C030 */
  .extern C2VECCLR         /* 0xBF88C034 */
  .extern C2VECSET         /* 0xBF88C038 */
  .extern C2VECINV         /* 0xBF88C03C */
  .extern C2TREC           /* 0xBF88C040 */
  .extern C2TRECCLR        /* 0xBF88C044 */
  .extern C2TRECSET        /* 0xBF88C048 */
  .extern C2TRECINV        /* 0xBF88C04C */
  .extern C2FSTAT          /* 0xBF88C050 */
  .extern C2FSTATCLR       /* 0xBF88C054 */
  .extern C2FSTATSET       /* 0xBF88C058 */
  .extern C2FSTATINV       /* 0xBF88C05C */
  .extern C2RXOVF          /* 0xBF88C060 */
  .extern C2RXOVFCLR       /* 0xBF88C064 */
  .extern C2RXOVFSET       /* 0xBF88C068 */
  .extern C2RXOVFINV       /* 0xBF88C06C */
  .extern C2TMR            /* 0xBF88C070 */
  .extern C2TMRCLR         /* 0xBF88C074 */
  .extern C2TMRSET         /* 0xBF88C078 */
  .extern C2TMRINV         /* 0xBF88C07C */
  .extern C2RXM0           /* 0xBF88C080 */
  .extern C2RXM0CLR        /* 0xBF88C084 */
  .extern C2RXM0SET        /* 0xBF88C088 */
  .extern C2RXM0INV        /* 0xBF88C08C */
  .extern C2RXM1           /* 0xBF88C090 */
  .extern C2RXM1CLR        /* 0xBF88C094 */
  .extern C2RXM1SET        /* 0xBF88C098 */
  .extern C2RXM1INV        /* 0xBF88C09C */
  .extern C2RXM2           /* 0xBF88C0A0 */
  .extern C2RXM2CLR        /* 0xBF88C0A4 */
  .extern C2RXM2SET        /* 0xBF88C0A8 */
  .extern C2RXM2INV        /* 0xBF88C0AC */
  .extern C2RXM3           /* 0xBF88C0B0 */
  .extern C2RXM3CLR        /* 0xBF88C0B4 */
  .extern C2RXM3SET        /* 0xBF88C0B8 */
  .extern C2RXM3INV        /* 0xBF88C0BC */
  .extern C2FLTCON0        /* 0xBF88C0C0 */
  .extern C2FLTCON0CLR     /* 0xBF88C0C4 */
  .extern C2FLTCON0SET     /* 0xBF88C0C8 */
  .extern C2FLTCON0INV     /* 0xBF88C0CC */
  .extern C2FLTCON1        /* 0xBF88C0D0 */
  .extern C2FLTCON1CLR     /* 0xBF88C0D4 */
  .extern C2FLTCON1SET     /* 0xBF88C0D8 */
  .extern C2FLTCON1INV     /* 0xBF88C0DC */
  .extern C2FLTCON2        /* 0xBF88C0E0 */
  .extern C2FLTCON2CLR     /* 0xBF88C0E4 */
  .extern C2FLTCON2SET     /* 0xBF88C0E8 */
  .extern C2FLTCON2INV     /* 0xBF88C0EC */
  .extern C2FLTCON3        /* 0xBF88C0F0 */
  .extern C2FLTCON3CLR     /* 0xBF88C0F4 */
  .extern C2FLTCON3SET     /* 0xBF88C0F8 */
  .extern C2FLTCON3INV     /* 0xBF88C0FC */
  .extern C2FLTCON4        /* 0xBF88C100 */
  .extern C2FLTCON4CLR     /* 0xBF88C104 */
  .extern C2FLTCON4SET     /* 0xBF88C108 */
  .extern C2FLTCON4INV     /* 0xBF88C10C */
  .extern C2FLTCON5        /* 0xBF88C110 */
  .extern C2FLTCON5CLR     /* 0xBF88C114 */
  .extern C2FLTCON5SET     /* 0xBF88C118 */
  .extern C2FLTCON5INV     /* 0xBF88C11C */
  .extern C2FLTCON6        /* 0xBF88C120 */
  .extern C2FLTCON6CLR     /* 0xBF88C124 */
  .extern C2FLTCON6SET     /* 0xBF88C128 */
  .extern C2FLTCON6INV     /* 0xBF88C12C */
  .extern C2FLTCON7        /* 0xBF88C130 */
  .extern C2FLTCON7CLR     /* 0xBF88C134 */
  .extern C2FLTCON7SET     /* 0xBF88C138 */
  .extern C2FLTCON7INV     /* 0xBF88C13C */
  .extern C2RXF0           /* 0xBF88C140 */
  .extern C2RXF0CLR        /* 0xBF88C144 */
  .extern C2RXF0SET        /* 0xBF88C148 */
  .extern C2RXF0INV        /* 0xBF88C14C */
  .extern C2RXF1           /* 0xBF88C150 */
  .extern C2RXF1CLR        /* 0xBF88C154 */
  .extern C2RXF1SET        /* 0xBF88C158 */
  .extern C2RXF1INV        /* 0xBF88C15C */
  .extern C2RXF2           /* 0xBF88C160 */
  .extern C2RXF2CLR        /* 0xBF88C164 */
  .extern C2RXF2SET        /* 0xBF88C168 */
  .extern C2RXF2INV        /* 0xBF88C16C */
  .extern C2RXF3           /* 0xBF88C170 */
  .extern C2RXF3CLR        /* 0xBF88C174 */
  .extern C2RXF3SET        /* 0xBF88C178 */
  .extern C2RXF3INV        /* 0xBF88C17C */
  .extern C2RXF4           /* 0xBF88C180 */
  .extern C2RXF4CLR        /* 0xBF88C184 */
