MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512l.h
  .extern C2FIFOCI26INV    /* 0xBF88CA0C */
  .extern C2FIFOCON27      /* 0xBF88CA10 */
  .extern C2FIFOCON27CLR   /* 0xBF88CA14 */
  .extern C2FIFOCON27SET   /* 0xBF88CA18 */
  .extern C2FIFOCON27INV   /* 0xBF88CA1C */
  .extern C2FIFOINT27      /* 0xBF88CA20 */
  .extern C2FIFOINT27CLR   /* 0xBF88CA24 */
  .extern C2FIFOINT27SET   /* 0xBF88CA28 */
  .extern C2FIFOINT27INV   /* 0xBF88CA2C */
  .extern C2FIFOUA27       /* 0xBF88CA30 */
  .extern C2FIFOUA27CLR    /* 0xBF88CA34 */
  .extern C2FIFOUA27SET    /* 0xBF88CA38 */
  .extern C2FIFOUA27INV    /* 0xBF88CA3C */
  .extern C2FIFOCI27       /* 0xBF88CA40 */
  .extern C2FIFOCI27CLR    /* 0xBF88CA44 */
  .extern C2FIFOCI27SET    /* 0xBF88CA48 */
  .extern C2FIFOCI27INV    /* 0xBF88CA4C */
  .extern C2FIFOCON28      /* 0xBF88CA50 */
  .extern C2FIFOCON28CLR   /* 0xBF88CA54 */
  .extern C2FIFOCON28SET   /* 0xBF88CA58 */
  .extern C2FIFOCON28INV   /* 0xBF88CA5C */
  .extern C2FIFOINT28      /* 0xBF88CA60 */
  .extern C2FIFOINT28CLR   /* 0xBF88CA64 */
  .extern C2FIFOINT28SET   /* 0xBF88CA68 */
  .extern C2FIFOINT28INV   /* 0xBF88CA6C */
  .extern C2FIFOUA28       /* 0xBF88CA70 */
  .extern C2FIFOUA28CLR    /* 0xBF88CA74 */
  .extern C2FIFOUA28SET    /* 0xBF88CA78 */
  .extern C2FIFOUA28INV    /* 0xBF88CA7C */
  .extern C2FIFOCI28       /* 0xBF88CA80 */
  .extern C2FIFOCI28CLR    /* 0xBF88CA84 */
  .extern C2FIFOCI28SET    /* 0xBF88CA88 */
  .extern C2FIFOCI28INV    /* 0xBF88CA8C */
  .extern C2FIFOCON29      /* 0xBF88CA90 */
  .extern C2FIFOCON29CLR   /* 0xBF88CA94 */
  .extern C2FIFOCON29SET   /* 0xBF88CA98 */
  .extern C2FIFOCON29INV   /* 0xBF88CA9C */
  .extern C2FIFOINT29      /* 0xBF88CAA0 */
  .extern C2FIFOINT29CLR   /* 0xBF88CAA4 */
  .extern C2FIFOINT29SET   /* 0xBF88CAA8 */
  .extern C2FIFOINT29INV   /* 0xBF88CAAC */
  .extern C2FIFOUA29       /* 0xBF88CAB0 */
  .extern C2FIFOUA29CLR    /* 0xBF88CAB4 */
  .extern C2FIFOUA29SET    /* 0xBF88CAB8 */
  .extern C2FIFOUA29INV    /* 0xBF88CABC */
  .extern C2FIFOCI29       /* 0xBF88CAC0 */
  .extern C2FIFOCI29CLR    /* 0xBF88CAC4 */
  .extern C2FIFOCI29SET    /* 0xBF88CAC8 */
  .extern C2FIFOCI29INV    /* 0xBF88CACC */
  .extern C2FIFOCON30      /* 0xBF88CAD0 */
  .extern C2FIFOCON30CLR   /* 0xBF88CAD4 */
  .extern C2FIFOCON30SET   /* 0xBF88CAD8 */
  .extern C2FIFOCON30INV   /* 0xBF88CADC */
  .extern C2FIFOINT30      /* 0xBF88CAE0 */
  .extern C2FIFOINT30CLR   /* 0xBF88CAE4 */
  .extern C2FIFOINT30SET   /* 0xBF88CAE8 */
  .extern C2FIFOINT30INV   /* 0xBF88CAEC */
  .extern C2FIFOUA30       /* 0xBF88CAF0 */
  .extern C2FIFOUA30CLR    /* 0xBF88CAF4 */
  .extern C2FIFOUA30SET    /* 0xBF88CAF8 */
  .extern C2FIFOUA30INV    /* 0xBF88CAFC */
  .extern C2FIFOCI30       /* 0xBF88CB00 */
  .extern C2FIFOCI30CLR    /* 0xBF88CB04 */
  .extern C2FIFOCI30SET    /* 0xBF88CB08 */
  .extern C2FIFOCI30INV    /* 0xBF88CB0C */
  .extern C2FIFOCON31      /* 0xBF88CB10 */
  .extern C2FIFOCON31CLR   /* 0xBF88CB14 */
  .extern C2FIFOCON31SET   /* 0xBF88CB18 */
  .extern C2FIFOCON31INV   /* 0xBF88CB1C */
  .extern C2FIFOINT31      /* 0xBF88CB20 */
  .extern C2FIFOINT31CLR   /* 0xBF88CB24 */
  .extern C2FIFOINT31SET   /* 0xBF88CB28 */
  .extern C2FIFOINT31INV   /* 0xBF88CB2C */
  .extern C2FIFOUA31       /* 0xBF88CB30 */
  .extern C2FIFOUA31CLR    /* 0xBF88CB34 */
  .extern C2FIFOUA31SET    /* 0xBF88CB38 */
  .extern C2FIFOUA31INV    /* 0xBF88CB3C */
  .extern C2FIFOCI31       /* 0xBF88CB40 */
  .extern C2FIFOCI31CLR    /* 0xBF88CB44 */
  .extern C2FIFOCI31SET    /* 0xBF88CB48 */
  .extern C2FIFOCI31INV    /* 0xBF88CB4C */
  .extern DEVCFG3          /* 0xBFC02FF0 */
  .extern DEVCFG2          /* 0xBFC02FF4 */
  .extern DEVCFG1          /* 0xBFC02FF8 */
  .extern DEVCFG0          /* 0xBFC02FFC */
#else
#error Unknown language!
#endif

#define _WDTCON_WDTCLR_POSITION                  0x00000000
#define _WDTCON_WDTCLR_MASK                      0x00000001
#define _WDTCON_WDTCLR_LENGTH                    0x00000001

#define _WDTCON_SWDTPS_POSITION                  0x00000002
#define _WDTCON_SWDTPS_MASK                      0x0000007C
#define _WDTCON_SWDTPS_LENGTH                    0x00000005

#define _WDTCON_ON_POSITION                      0x0000000F
#define _WDTCON_ON_MASK                          0x00008000
#define _WDTCON_ON_LENGTH                        0x00000001

#define _WDTCON_SWDTPS0_POSITION                 0x00000002
#define _WDTCON_SWDTPS0_MASK                     0x00000004
#define _WDTCON_SWDTPS0_LENGTH                   0x00000001

#define _WDTCON_SWDTPS1_POSITION                 0x00000003
#define _WDTCON_SWDTPS1_MASK                     0x00000008
#define _WDTCON_SWDTPS1_LENGTH                   0x00000001

#define _WDTCON_SWDTPS2_POSITION                 0x00000004
#define _WDTCON_SWDTPS2_MASK                     0x00000010
#define _WDTCON_SWDTPS2_LENGTH                   0x00000001

#define _WDTCON_SWDTPS3_POSITION                 0x00000005
#define _WDTCON_SWDTPS3_MASK                     0x00000020
#define _WDTCON_SWDTPS3_LENGTH                   0x00000001

#define _WDTCON_SWDTPS4_POSITION                 0x00000006
#define _WDTCON_SWDTPS4_MASK                     0x00000040
#define _WDTCON_SWDTPS4_LENGTH                   0x00000001

#define _WDTCON_WDTPSTA_POSITION                 0x00000002
#define _WDTCON_WDTPSTA_MASK                     0x0000007C
#define _WDTCON_WDTPSTA_LENGTH                   0x00000005

#define _WDTCON_WDTPS_POSITION                   0x00000002
#define _WDTCON_WDTPS_MASK                       0x0000007C
#define _WDTCON_WDTPS_LENGTH                     0x00000005

#define _WDTCON_w_POSITION                       0x00000000
#define _WDTCON_w_MASK                           0xFFFFFFFF
#define _WDTCON_w_LENGTH                         0x00000020

#define _RTCCON_RTCOE_POSITION                   0x00000000
#define _RTCCON_RTCOE_MASK                       0x00000001
#define _RTCCON_RTCOE_LENGTH                     0x00000001

#define _RTCCON_HALFSEC_POSITION                 0x00000001
#define _RTCCON_HALFSEC_MASK                     0x00000002
#define _RTCCON_HALFSEC_LENGTH                   0x00000001

#define _RTCCON_RTCSYNC_POSITION                 0x00000002
#define _RTCCON_RTCSYNC_MASK                     0x00000004
#define _RTCCON_RTCSYNC_LENGTH                   0x00000001

